RubymineProjects/SiV/app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "oauth_expires_at", "oauth_token", "provider", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "users" SET "ip_address" = $1, "log_last_connection" = $2, "updated_at" = $3 WHERE "users"."id" = 1  [["ip_address", "127.0.0.1"], ["log_last_connection", "log_last"], ["updated_at", Fri, 06 Nov 2015 19:30:14 UTC +00:00]]
---
  def create
    user = User.from_omniauth(env["omniauth.auth"])

    session[:user_id] = user.id
    session[:user_ip] = request.remote_ip
    user.ip_address = request.remote_ip
   # puts user.ip_address
    user.log_last_connection = 'log_last'
    puts user
   # puts user.log_last_connection
    user.save!