RubymineProjects/SiV/app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos" ORDER BY "videos"."created_at" ASC
SELECT "localvdos".* FROM "localvdos" ORDER BY "localvdos"."created_at" ASC
---
  def index

  #  Localvdo.all.each do |llvideo|
  #    ping llvideo.url
  #    ping "http://www.google.com"
  #  end
   # ping "http://www.google.com"
    puts "Inside index..............."
    if current_user
      #token = current_user.oauth_token

      Koala.config.api_version = "v2.0"

      @graph = Koala::Facebook::API.new(current_user.oauth_token)
      #  profile = @graph.get_object("me")
      friends = @graph.get_connections("me", "friends")
      puts "frilit shld be here"
      puts friends
      @frilist = Array.new

      friends.each do |hash|
        @frilist.push(hash['id'])
        puts hash['id']

      end
    end
    @same_network = is_same_network(session[:user_id])
    @Nvideos = Video.all
    # @Nvideos = @videolist
    @videos = @Nvideos.order(:created_at).reverse
    # sorted = @records.sort_by &:created_at
    @locals = Localvdo.all

SELECT "localvdos".* FROM "localvdos" WHERE "localvdos"."user_id" = 1
---
  def edit
    @localvdo_for_given_user = Localvdo.where(user_id: session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "videos" WHERE "videos"."id" = $1  [["id", 1]]
---
  def destroy
    @user = User.find(session[:user_id])
    @video.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def timelinevdo
    puts "Time line video................."
    vdo_list = []
    user_id = session[:user_id]
    user_obj = User.find(user_id)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "videos".* FROM "videos" WHERE "videos"."uid" = '1600426553558641' AND "videos"."facebook_vid" = '1660630157538280'
INSERT INTO "videos" ("created_at", "facebook_vid", "inLocal", "link", "local_link", "name", "thumbnail_link", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def fetch
    puts "Fetching Facebook shared videos (UGC upload)....................."

    user_id = session[:user_id]
    user_obj = User.find(user_id)
    options = {:access_token => user_obj.oauth_token}
    query = 'SELECT owner, vid, title, thumbnail_link, embed_html FROM video WHERE owner=me()'

    begin
      @parsed_json = Fql.execute(query, options)
      puts @parsed_json

      @parsed_json.each do |obj|
        if Video.where(:uid => user_obj.uid, :facebook_vid => obj['vid'].to_s).blank?
          #puts "current obj['vid'] = " + obj['vid'].to_s

          vdo = Video.new()
          if obj['title'].length == 0
            vdo.name = "untitled"
          else
            vdo.name = obj['title']
          end
          vdo.thumbnail_link = obj['thumbnail_link']
          vdo.link = obj['embed_html']
          vdo.local_link = ""
          vdo.facebook_vid = obj['vid']
          vdo.uid = user_obj.uid
          vdo.user_id = user_id
          vdo.inLocal = false
          vdo.save!