RubymineProjects/SiV/app/views/videos/index.html.erb


        <% @uploader = User.find(video.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]